STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr_ddrphy_phyinit_usercustom_customposttrain.c
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB2 | P0 | U0 | TDBYTE | CSR_RXPBDLYTG1_ADDR))),
                0x7FU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB2 | P0 | U1 | TDBYTE | CSR_RXPBDLYTG1_ADDR))),
                0x7FU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB2 | P0 | (U1 * 2U) | TDBYTE |
                                                CSR_RXPBDLYTG1_ADDR))),
                0x7FU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB2 | P0 | (U1 * 3U) | TDBYTE |
                                                CSR_RXPBDLYTG1_ADDR))),
                0x7FU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB2 | P0 | (U1 * 4U) | TDBYTE |
                                                CSR_RXPBDLYTG1_ADDR))),
                0x7FU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB2 | P0 | (U1 * 5U) | TDBYTE |
                                                CSR_RXPBDLYTG1_ADDR))),
                0x7FU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB2 | P0 | (U1 * 6U) | TDBYTE |
                                                CSR_RXPBDLYTG1_ADDR))),
                0x7FU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB2 | P0 | (U1 * 7U) | TDBYTE |
                                                CSR_RXPBDLYTG1_ADDR))),
                0x7FU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB2 | P0 | (U1 * 8U) | TDBYTE |
                                                CSR_RXPBDLYTG1_ADDR))),
                0x7FU);

  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB3 | P0 | U0 | TDBYTE | CSR_RXPBDLYTG1_ADDR))),
                0x7FU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB3 | P0 | U1 | TDBYTE | CSR_RXPBDLYTG1_ADDR))),
                0x7FU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB3 | P0 | (U1 * 2U) | TDBYTE |
                                                CSR_RXPBDLYTG1_ADDR))),
                0x7FU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB3 | P0 | (U1 * 3U) | TDBYTE |
                                                CSR_RXPBDLYTG1_ADDR))),
                0x7FU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB3 | P0 | (U1 * 4U) | TDBYTE |
                                                CSR_RXPBDLYTG1_ADDR))),
                0x7FU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB3 | P0 | (U1 * 5U) | TDBYTE |
                                                CSR_RXPBDLYTG1_ADDR))),
                0x7FU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB3 | P0 | (U1 * 6U) | TDBYTE |
                                                CSR_RXPBDLYTG1_ADDR))),
                0x7FU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB3 | P0 | (U1 * 7U) | TDBYTE |
                                                CSR_RXPBDLYTG1_ADDR))),
                0x7FU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB3 | P0 | (U1 * 8U) | TDBYTE |
                                                CSR_RXPBDLYTG1_ADDR))),
                0x7FU);

  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB0 | P0 | R0 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB0 | P0 | R1 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB0 | P0 | R2 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB0 | P0 | R3 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB0 | P0 | R4 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB0 | P0 | R5 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB0 | P0 | R6 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB0 | P0 | R7 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB0 | P0 | R8 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);

  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB1 | P0 | R0 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB1 | P0 | R1 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB1 | P0 | R2 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB1 | P0 | R3 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB1 | P0 | R4 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB1 | P0 | R5 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB1 | P0 | R6 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB1 | P0 | R7 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB1 | P0 | R8 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);

  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB2 | P0 | R0 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB2 | P0 | R1 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB2 | P0 | R2 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB2 | P0 | R3 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB2 | P0 | R4 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB2 | P0 | R5 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB2 | P0 | R6 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB2 | P0 | R7 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB2 | P0 | R8 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);

  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB3 | P0 | R0 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB3 | P0 | R1 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB3 | P0 | R2 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB3 | P0 | R3 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB3 | P0 | R4 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB3 | P0 | R5 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB3 | P0 | R6 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB3 | P0 | R7 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);
  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (BB3 | P0 | R8 | TDBYTE | CSR_TXDQDLYTG1_ADDR))),
                0x5EU);

  mmio_write_16((uintptr_t)(DDRPHYC_BASE + (4U * (TAPBONLY | CSR_MICROCONTMUXSEL_ADDR))), 0x1U);
#endif /* STM32MP_LPDDR4_TYPE */
#endif /* USE_STM32MP257CXX_EMU */

  VERBOSE("%s End\n", __func__);
}

